#include <stdio.h>

int main(void)
{
	int ary[3]; // 배열 선언
	int *pa = ary; // 포인터에 배열명 (저장 포인터 선언 및 초기화) 
				   // -> 일반 포인터 변수를 초기화할 시에는 오른편에 일반 변수 앞에 &(주소 연산자)를 넣어야 하나, 
				   // 	 배열은 없음. 즉 배열 자체가 포인터 주소값을 이미 가지고 있다는 말.
	int i;

	*pa = 10;	// 첫 번째 배열 요소에 10 대입
	*(pa + 1) = 20;		// 두 번째 배열 요소에 20 대입 
	pa[2] = pa[0] + pa[1];	// 세 번째 배열 요소에 첫 번째 배열 요소와 두 번째 배열 요소값을 더함 -> 대괄호를 써서 pa를 배열명처럼 사용

	for (i=0; i < 3; i++)
	{
		printf("%5d ", pa[i]);
	}
	printf("\n배열 전체의 크기 : %ld\n", sizeof(ary));
	printf("포인터 하나의 크기 : %ld\n", sizeof(pa)); // 포인터의 크기는 컴파일러에 따라 다를 수 있으나(ARM64 아키텍트는 8byte), 
												 // 모든 주소와 포인터는 가리키는 자료형과 상관없이 그 크기가 같다.

	return 0;
}