#include <stdio.h>

int main(void)
{
	int ary[3] = { 10, 20, 30 };
	int *pa = ary;
	int i;

	printf("배열의 값 : ");
	for ( i=0; i<3; i++)
	{
		printf("%d ", *(pa++)); // pa를 배열명처럼 사용해 첫 번째 배열 요소를 출력 : pa[0] 
							// pa[0]를 그대로 포인터 연산식으로 바꾸는 방법 : *(pa + 0)
							// 위의 방법보다 간결한, 의미 없는 0과 괄호를 제거해서 출력 : *pa -> 후위연산자를 각 포인터마다 적용해서 출력
	//	pa++; // 포인터는 변수이므로 후위연산자를 통해 값의 증가 연산 가능(but, ary++ 는 상수이므로 값을 변경할 수 없음. 
			  // 결국, 배열명 자체로는 중복연산을 할 수 없기 때문에 앞선, 10-1 예제보다 간결하게 포인터를 이용해서 배열의 값 '연속' 출력함.)
	}

	return 0;
}