# include <stdio.h>

int main(void)
{
	char small, cap = 'G';			// char형 변수 선언과 초기화

	if ((cap >= 'A') && (cap <= 'Z')) // 대문자 범위라면
	{
		small = cap + ('a' - 'A');	// 대/소문자의 차이(32)를 더해 소문자로 변환 -> g
	}

	printf("대문자 : %c %c", cap, '\n'); // '\n'을 %c로 출력하면 줄이 바뀜
									// (->저장 시에는 아스키코드값 10이 이진수로 변환되고 출력형태에 변환 문자열에 따라 결정)
	printf("소문자 : %c", small);		// 제어문자도 33개가 있는데 아스키코드값은 0(\0), 9(\t), 10('\n'), 13('\r')<- Carriage Reture(줄의 맨 앞으로 옮김)
									// 제어문자는 백슬래시와 함께 표시하며 출력할 때 그 기능을 수행함.
	return 0;						// 또한 데이터 통신에 쓰이거너ㅏ 화면의 출력 위치를 조정함.
}
